app/controllers/blog_posts_controller.rb

UPDATE "blog_posts" SET "updated_at" = ? WHERE "blog_posts"."id" = ?  [["updated_at", "2019-04-16 19:17:45.661534"], ["id", 6]]
---
  def update
    @post = BlogPost.find params[:id]
    if (@post.user == current_user)
      @post.update(create_update_params)
      if @post.save

SELECT  "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    @post = BlogPost.find(params[:id])