app/controllers/blog_posts_controller.rb

  def index
    @posts = BlogPost.all
---
SELECT "blog_posts".* FROM "blog_posts" WHERE (location == 'Coop') AND (category == 'Breakfast')

  def show
    @post = BlogPost.find(params[:id])
---
SELECT  "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @post = BlogPost.find(params[:id])
---
SELECT  "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def update
    @post = BlogPost.find params[:id]
    @post.update(create_update_params)
    if @post.update(create_update_params)
---
SELECT  "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "blog_posts" SET "rating" = ?, "updated_at" = ? WHERE "blog_posts"."id" = ?  [["rating", 1], ["updated_at", "2019-04-04 21:59:39.853323"], ["id", 9]]
UPDATE "blog_posts" SET "description" = ?, "updated_at" = ? WHERE "blog_posts"."id" = ?  [["description", "ah, st like grandmothers!"], ["updated_at", "2019-04-04 21:47:40.025114"], ["id", 4]]

  def destroy
    @post = BlogPost.find(params[:id])
    @post.destroy
---
SELECT  "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "blog_posts" WHERE "blog_posts"."id" = ?  [["id", 6]]

  def create
    @post = BlogPost.new(create_update_params)

    if !@post.location?
      flash[:warning] = "No Location Provided - Failed to Create Blog Post."
      redirect_to(new_blog_post_path()) and return
    elsif !@post.title?
      flash[:warning] = "No Title Provided - Failed to Create Blog Post."
      redirect_to(new_blog_post_path()) and return
    elsif !@post.rating? && !@post.rating == 0
      flash[:warning] = "No Rating Provided - Failed to Create Blog Post."
      redirect_to(new_blog_post_path()) and return
    elsif !@post.category?
      flash[:warning] = "No Meal Time Provided - Failed to Create Blog Post."
      redirect_to(new_blog_post_path()) and return
    elsif @post.save
---
INSERT INTO "blog_posts" ("location", "category", "description", "title", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["location", "Coop"], ["category", "Breakfast"], ["description", "a"], ["title", "a"], ["rating", 0], ["created_at", "2019-04-05 01:22:36.852020"], ["updated_at", "2019-04-05 01:22:36.852020"]]