app/controllers/comments_controller.rb

  def create
    @post = BlogPost.find(params[:id])
    # if @post.nil?
    #   redirect_to blog_posts_path
    # else
    @comment = Comment.new(create_comment_params)
    @comment.user = current_user
    @post.comments << @comment
---
SELECT  "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("comment", "user_id", "blog_post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "good"], ["user_id", 3], ["blog_post_id", 1], ["created_at", "2019-04-19 18:55:21.305755"], ["updated_at", "2019-04-19 18:55:21.305755"]]